---
kind: type
id: T:Autodesk.Revit.Attributes.TransactionAttribute
source: html/fac3d5df-fa90-b901-70d2-c94615b28303.htm
---
# Autodesk.Revit.Attributes.TransactionAttribute

The custom transaction attribute to control the transaction behavior of the external command.

## Syntax (C#)
```csharp
public class TransactionAttribute : Attribute
```